Revit 2026 API

# IFCDataCreateEnumeration Method

---

Creates a enum data object.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IFCData CreateEnumeration(
	string value
)
```
```vb
Public Shared Function CreateEnumeration (
	value As String
) As IFCData
```
```cpp
public:
static IFCData^ CreateEnumeration(
	String^ value
)
```
```fsharp
static member CreateEnumeration :
        value : string -> IFCData
```

#### Parameters

value String
     The string value.

#### Return Value

IFCData The IFCData object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCData Class

Autodesk.Revit.DB.IFC Namespace